Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
                    /* Run LQR once per 250 Hz cycle; cache both wheel commands. */
                    lqr_update(&g_lqr,
                               body_pitch,
                                body_pitch_rate,
                                wheel_vel_l,
                                wheel_vel_r,
                                g_mahony.yaw,
                                yaw_rate,
                                hb.target_velocity,
                                hb.target_yaw_rate,
                                (g_safety_state.current_mode == STATE_ACTIVE &&
                                 pi_link_is_compatible() && pi_link_heartbeat_fresh() && pi_link_action_fresh())
                                    ? act.delta_torque_common : 0.0f,
                                (g_safety_state.current_mode == STATE_ACTIVE &&
                                 pi_link_is_compatible() && pi_link_heartbeat_fresh() && pi_link_action_fresh())
                                    ? act.delta_torque_yaw : 0.0f,
                                &g_ctrl_tau_l,
                                &g_ctrl_tau_r);

                    ddsm_set_torque(&huart2, DDSM_LEFT_ID, WHEEL_DIR_L * g_ctrl_tau_l);
                } else {
                    /* Safe stop wheels if in FAULT or INIT */
                    g_ctrl_tau_l = 0.0f;
                    g_ctrl_tau_r = 0.0f;
                    ddsm_set_torque(&huart2, DDSM_LEFT_ID, 0.0f);
                }

                /* Discard RS485 self-echo, then block-read Left feedback (10 bytes) */
                __HAL_UART_CLEAR_OREFLAG(&huart2);
                __HAL_UART_FLUSH_DRREGISTER(&huart2);
                uint8_t rx_buf[10];
                if (HAL_UART_Receive(&huart2, rx_buf, 10, 2) == HAL_OK) {
                    ddsm_parse_feedback(rx_buf, &g_ddsm_left);
                }

            }

            /* The right motor has an independent staggered deadline. This keeps
             * the two blocking half-duplex transactions from routinely sharing
             * one 4 ms control slot. */
            if (right_due && startup_manager.phase >= STARTUP_ACTUATOR_DISCOVERY) {
                last_right_tick = last_tick;
                if (g_safety_state.current_mode != STATE_FAULT && g_safety_state.current_mode != STATE_INIT) {
                    ddsm_set_torque(&huart2, DDSM_RIGHT_ID, WHEEL_DIR_R * g_ctrl_tau_r);
                } else {
                    ddsm_set_torque(&huart2, DDSM_RIGHT_ID, 0.0f);
                }

                /* Discard RS485 self-echo, then block-read Right feedback (10 bytes) */
                __HAL_UART_CLEAR_OREFLAG(&huart2);
                __HAL_UART_FLUSH_DRREGISTER(&huart2);
                uint8_t right_rx_buf[10];
                if (HAL_UART_Receive(&huart2, right_rx_buf, 10, 2) == HAL_OK) {
                    ddsm_parse_feedback(right_rx_buf, &g_ddsm_right);
                }
            }

            /* --- Slot 2: Queue telemetry data to Raspberry Pi 5 --- */
            if (slot == 2) {
                pi_link_send_imu(&huart6, 
                                 g_mahony.roll, 
                                 g_mahony.pitch, 
                                 g_mahony.yaw, 
                                  g_body_gyro[0],
                                  g_body_gyro[1],
                                  g_body_gyro[2]);

                /* Report joint feedback in the shared sim/body frame so it is
                 * symmetric with the command contract (mirror + zero applied). */
                float servo_pos[4], servo_vel[4], servo_cur[4];
                for (int i = 0; i < 4; i++) {
                    servo_pos[i] = servo_tick_to_angle(g_servos[i].position_tick, (uint8_t)i);
                    servo_vel[i] = (float)servo_direction((uint8_t)i) * g_servos[i].velocity_rads;
                    servo_cur[i] = g_servos[i].current_a;
                }

                /* Single-turn wheel angle (raw); velocity/torque mapped to body frame */
                float wheel_l_pos = g_ddsm_left.position_rad;
                float wheel_r_pos = g_ddsm_right.position_rad;

                pi_link_send_joints(&huart6,
                                    wheel_l_pos, WHEEL_DIR_L * g_ddsm_left.velocity_rads, WHEEL_DIR_L * g_ddsm_left.torque,
                                    wheel_r_pos, WHEEL_DIR_R * g_ddsm_right.velocity_rads, WHEEL_DIR_R * g_ddsm_right.torque,
                                    servo_pos, servo_vel, servo_cur);
            }

            /* --- Slot 3: Diagnostic packages & main controller logic --- */
            else if (slot == 3) {
                /* Battery sensing is not populated on this hardware.  Zero is
                 * the protocol sentinel for unavailable, not an undervoltage. */
                pi_link_send_diag(&huart6, 0U, (uint8_t)g_imu.temperature,
                                  safety_state_legacy_fault_mask());

                if (g_safety_state.current_mode == STATE_FAULT) {
                    pi_link_send_fault(&huart6, safety_state_legacy_fault_mask());
                }
            }
        }

        /* --- 50 Hz Background Loop: ST3215 Servo Control --- */
        uint32_t current_time = HAL_GetTick();
        if (startup_manager.phase >= STARTUP_ACTUATOR_DISCOVERY &&
            current_time - last_servo_loop_time >= (1000 / SERVO_LOOP_FREQ)) {
            last_servo_loop_time = current_time;

            uint8_t ids[4] = {SERVO_LF_ID, SERVO_RF_ID, SERVO_LB_ID, SERVO_RB_ID};

#if SERVO_ZERO_CALIBRATION_MODE
            /* Position commands are intentionally suppressed. System setup
             * has already disabled torque; feedback polling below still runs. */
            (void)ids;
#else
            if (g_safety_state.current_mode == STATE_ACTIVE) {
                /* Pi supplies bounded workspace residuals.  Project them through
                 * the same dwell-relative (Qx,D0) five-bar IK as the simulator. */
                Pi_Command_Heartbeat_t hb;
                Pi_Command_Action_t act;
                Pi_Command_Snapshot(&hb, &act);
                int16_t pos_ticks[4];
                uint16_t speed_ticks[4] = {2000, 2000, 2000, 2000};
                uint8_t accels[4] = {50, 50, 50, 50};
                float action_scale = (pi_link_is_compatible() && pi_link_heartbeat_fresh() &&
                                      pi_link_action_fresh()) ? 1.0f : 0.0f;
                float d0_max = (fabsf(hb.target_velocity) > D0_GATE_V_THRESH ||
                                fabsf(hb.target_yaw_rate) > D0_GATE_W_THRESH)
                                   ? D0_GATE_MAX_HIGH * 0.001f : KIN_MAX_LEG_D0;
                float roll_term_mm = -(KUAFU_ROLL_KP * g_mahony.roll +
                                       KUAFU_ROLL_KD * g_body_gyro[0]);
                float d0_l = hb.target_leg_d0 + 0.001f * roll_term_mm / 2.0f +
                             0.001f * D0_RESIDUAL_SCALE_MM * action_scale * act.d0_l;
                float d0_r = hb.target_leg_d0 - 0.001f * roll_term_mm / 2.0f +
                             0.001f * D0_RESIDUAL_SCALE_MM * action_scale * act.d0_r;
                if (d0_l < KIN_MIN_LEG_D0) d0_l = KIN_MIN_LEG_D0;
                if (d0_l > d0_max) d0_l = d0_max;
                if (d0_r < KIN_MIN_LEG_D0) d0_r = KIN_MIN_LEG_D0;
                if (d0_r > d0_max) d0_r = d0_max;
                float qA_l, qB_l, qA_r, qB_r;
                if (kinematics_solve_ik_xy(QX_RESIDUAL_SCALE_MM * 0.001f * action_scale * act.qx_l, d0_l, &qA_l, &qB_l) == 0 &&
                    kinematics_solve_ik_xy(QX_RESIDUAL_SCALE_MM * 0.001f * action_scale * act.qx_r, d0_r, &qA_r, &qB_r) == 0) {
                    pos_ticks[0] = servo_angle_to_tick(qA_l, 0);
                    pos_ticks[1] = servo_angle_to_tick(qA_r, 1);
                    pos_ticks[2] = servo_angle_to_tick(qB_l, 2);
                    pos_ticks[3] = servo_angle_to_tick(qB_r, 3);
                    st3215_sync_write_pos(&huart3, ids, 4, pos_ticks, speed_ticks, accels);
                }
            }
            else if (g_safety_state.current_mode == STATE_STAND || g_safety_state.current_mode == STATE_CLIMB) {
                /* Standing/Climbing virtual height mode */
                Pi_Command_Heartbeat_t hb;
                Pi_Command_Action_t act;
                Pi_Command_Snapshot(&hb, &act);
                (void)act;

                float q_hip_A = 0.0f; /* A chain, pivot x=-c (LF, RF) */
                float q_hip_B = 0.0f; /* B chain, pivot x=+c (LB, RB) */

                /* Compute inverse kinematics mapping for target height */
                if (kinematics_solve_ik(hb.target_leg_d0, &q_hip_A, &q_hip_B) == 0) {
                    int16_t pos_ticks[4];
                    uint16_t speed_ticks[4] = {1500, 1500, 1500, 1500};
                    uint8_t accels[4] = {30, 30, 30, 30};

                    pos_ticks[0] = servo_angle_to_tick(q_hip_A, 0); /* LF (A chain) */
                    pos_ticks[1] = servo_angle_to_tick(q_hip_A, 1); /* RF (A chain) */
                    pos_ticks[2] = servo_angle_to_tick(q_hip_B, 2); /* LB (B chain) */
                    pos_ticks[3] = servo_angle_to_tick(q_hip_B, 3); /* RB (B chain) */

                    st3215_sync_write_pos(&huart3, ids, 4, pos_ticks, speed_ticks, accels);
                }
            }
            else if (g_safety_state.current_mode == STATE_FAULT) {
                /* Lockdown: disable servo torque once to allow gravity lock.
                 * Sending the disable every 50 Hz cycle floods the full-duplex
                 * bus with echo bytes that desync subsequent read queries, so a
                 * one-shot flag is used instead of repeated transmission. */
                static uint8_t fault_torque_disabled = 0;
                if (!fault_torque_disabled) {
                    for (int i = 0; i < 4; i++) {
                        st3215_set_torque_enable(&huart3, ids[i], 0);
                    }
                    fault_torque_disabled = 1;
                }
            }
#endif

            /* Sequentially query feedback from one online servo to prevent blocking.
             * A servo that stays unreachable triggers a fatal FAULT lockdown. */
            ST3215_State_t *qs = &g_servos[active_servo_query_idx];
            if (qs->health.online) {
                int read_result = st3215_read_state(&huart3, ids[active_servo_query_idx], qs);
                if (read_result == 0) {
                    /* Driver marks the shared health record valid. */
                } else if (g_safety_state.current_mode == STATE_INIT) {
                    /* Ignore transient boot races before calibration; keep retrying */
                    device_health_mark_failure(&qs->health,
                                               read_result == -2 ? DEVICE_FAILURE_CHECKSUM : DEVICE_FAILURE_TIMEOUT,
                                               0U);
                    qs->health.consecutive_failures = 0U;
                } else {
                    device_health_mark_failure(&qs->health,
                                               read_result == -2 ? DEVICE_FAILURE_CHECKSUM : DEVICE_FAILURE_TIMEOUT,
                                               SERVO_FAIL_LIMIT);
                    if (!qs->health.online) {
                        safety_state_trigger_fault(FAULT_SERVO); /* fatal lockdown */
                    }
                }
            }
            active_servo_query_idx = (active_servo_query_idx + 1) % 4;
        }
    }
}

/**
 * @brief EXTI1 callback: triggered at 1kHz by Gyro DRDY pin (PB1).
 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
    if (GPIO_Pin == IMU_INT_PIN) {
        g_system_ticks++;
    }
}

/**
 * @brief Atomically snapshots the Pi command state (updated in the USART6 ISR)
 *        to avoid torn multi-byte reads in the main loop.
 */
static void Pi_Command_Snapshot(Pi_Command_Heartbeat_t *hb, Pi_Command_Action_t *act) {
    HAL_NVIC_DisableIRQ(USART6_IRQn);
    *hb = g_pi_cmd_heartbeat;
    *act = g_pi_cmd_action;
    HAL_NVIC_EnableIRQ(USART6_IRQn);
}

/**
 * @brief System Clock Configuration to 168MHz (from 8MHz HSE)
 */
void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM = 8;
    RCC_OscInitStruct.PLL.PLLN = 336;
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2; /* SYSCLK = 168MHz */
    RCC_OscInitStruct.PLL.PLLQ = 7;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        Error_Handler();
    }

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                  RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4; /* APB1 = 42MHz */
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2; /* APB2 = 84MHz */
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK) {
        Error_Handler();
    }
}

